

export const destructurization = `
  <div>
  <h2>Что это?</h2>
  <p>Специальная комманда, которая позволяет <span class="mark">делать копии</span> массивов или объектов </p>
  <h2>Зачем это?</h2>
  <p>Нужно, когда по каким либо причинам мы хотим сделать независимую копию массива или объекта
   , например, когда <span class="mark">работает со стейтом в реакт</span>, 
  тем самым, мы точно можем быть уверенны, что добавлять или удалять будем элементы или ключи из копии, а не из оригинала, который
  останется неизменным.
  </p>
  <h2>Что для этого нужно?</h2>
  <ol>
    <li><p>Определиться, копию чего именно мы хотим сделать - массива или объекта</p></li>
    <li><p>Для массива поставить квадратные скобки [], а для объекта - фигурные{}</p></li>
    <li><p>Внутри скобок потавить оператор многоточия "...", а после них - нужную переменную</p></li>
  </ol>
</div>
`
