

export const rtk = `
  <div>
  <h2>Что это?</h2>
  <p>Это библиотека улучшенного редакса, позволяющая <span class="mark">хранить все данные и функции</span>в одном месте</p>
  <h2>Зачем это?</h2>
  <p>Весь посыл всегда один - <span class="mark">при изменении каких-либо переменных тут же перерисовывать html</span>. В Redux Toolkit это делать проще, поскольку всё необходимое будет лежать отдельно в файлике</p>
  <h2>Что для этого нужно?</h2>
  <ol>
    <li>Установить и подключить стор</p></li>
    <li>Создать слайс, в котором будут существовать данные и функции для работы с ними</p></li>
    <li>Внутри компонента вызывать useSelector и useDispatch для получения доступа к "коробке с переменными" и к "коробке с функциями"</p></li>
  </ol>
  <a href="https://www.figma.com/design/aNxp3G306blFzHb8Cf7oib/Untitled?node-id=0-1&t=oL8j3rsRC5Fk9ARZ-0" target="_blank">Схему в фигме можно посмотреть здесь</a>
  <a href="https://redux-toolkit.js.org/tutorials/quick-start" target="_blank">А документация с примером работы тут</a>
</div>
`
